pulmanturbd/certification4/DiningListRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:din="http://services.rccl.com/Interfaces/DiningList" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
   <soapenv:Header/>
   <soapenv:Body>
      <din:getDiningList>
        <OTA_CruiseDiningAvailRQ RetransmissionIndicator="false" SequenceNmbr="1" TimeStamp="2008-12-29T18:25:50.1Z" TransactionIdentifier="106597" Version="1.0" Target="Test" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
            <POS>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
            </POS>
            <Guest LoyaltyMembershipID="8888890"/>
            <Guest LoyaltyMembershipID="7777779"/>
            <GuestCounts>
                <GuestCount Age="30" Quantity="1"/>
                <GuestCount Age="1" Quantity="1"/>
            </GuestCounts>
            <SailingInfo>
                <SelectedSailing ListOfSailingDescriptionCode="6" Start="2020-08-15" Duration="P7N" Status="36" PortsOfCallQuantity="5">
                    <CruiseLine ShipCode="MO" VendorCode="PUL"/>
                    <!--Optional:-->
                    <Region RegionCode="PBLCS" SubRegionCode="PBC"/>
                    <!--Optional:-->
                    <DeparturePort LocationCode="HEL"/>
                    <!--Optional:-->
                    <ArrivalPort LocationCode="RLG"/>
                </SelectedSailing>
                <!--Optional:-->
                <alp:InclusivePackageOption CruisePackageCode="MOPB0750" InclusiveIndicator="false"/>
                <!--Optional:-->
                <Currency CurrencyCode="USD" DecimalPlaces="2"/>
                <SelectedCategory BerthedCategoryCode="GT" PricedCategoryCode="GT"/>
            </SailingInfo>
            <SelectedFare GroupCode="24"/>
            <TPA_ReservationId Type="14" ID="0"/>
        </OTA_CruiseDiningAvailRQ>
    </din:getDiningList>
    </soapenv:Body>
</soapenv:Envelope>